src/Misc/MiscNotes/shadowsocks超详细科普教程.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: shadowsocks超详细科普教程
#+OPTIONS: num:nil H:2


没有可用的shadowsocks节点线路，shadowsocks在你手里也是浮云这个作为重点先说一下
* Docker + DigitalOcean + Shadowsocks 5分钟科学上网
+ Shadowsocks for OSX:
  https://github.com/shadowsocks/shadowsocks-iOS/wiki/Shadowsocks-for-OSX-%E5%B8%AE%E5%8A%A9
+ Shadowsocks clients: https://shadowsocks.com/client.html

1. choose docker 16.2 on 14.04
2. add ssh keys
3. 安装 Shadowsocks
   #+begin_src sh
      docker pull oddrationale/docker-shadowsocks
     docker run -d -p 1984:1984 oddrationale/docker-shadowsocks -s 0.0.0.0 -p 1984 -k paaassswwword -m aes-256-cfb
   #+end_src
    paaassswwword 就是等下配置客户端需要的密码
4. check
  #+begin_src sh
    docker ps
   #+end_src
5. 客户端配置： ip, port, password, and aes-256-cfb

* Shadowsocks的小白使用教程
+ http://51.ruyo.net/p/412.html
+ http://t.cn/Ry42Kbx

chrome浏览器配合代理扩展的设置，下拉记事本滑块到底，看附3
首先明确一点，不管 Shadowsocks 有几种版本，都分为服务端和客户端，
服务端是部署在服务器（VPS）上的，客户端是在你的电脑上使用的。
简单说一下windows系统，你有shadowsocks节点的情况下，Shadowsocks客户端的设置代理使用教程
一定要有有效SS节点才行 一定要有有效SS节点才行网或群共享下载Windows系统
的Shadowsocks客户端软件为绿色免安装，下载 解压到任意目录，如：
D:/Program Files/shadowsocksshadowsocks的账号(本地客户端配置参数)一般
包括这么几个部分

4-1 ：服务器 IP （一般为域名或数字ip）

4-2： Port ：服务器端口 （不同的账号的端口也都是不同的）

4-3 ：Password：你的密码

4-4 ：加密模式：鼠标点击下拉小三角选取

依次手动输入以下3项
shadowsocks 服务器域名或IP服务器端口密码并选择ss服务商提供的节点对应的加密方式
点击“确定”
右下角的 代理端口 指的是本地监听端口，一般保持默认1080就可以，不用你填。
现在的ss站都提供二维码形式的ss节点配置参数文件
对于二维码形式的ss节点配置文件，也可以用客户端自带的二维码扫描功能快速添加
右键>任务栏>ss客户端图标>服务器>扫描屏幕二维码
客户端支持添加多线路节点，方便你切换，选择相对你网络环境质量较好，速度快的节点。
shadowsocks节点速度快慢，影响shadowsocks节点速度的因素：
你的机房（地理位置，影响节点路由），运营商（网络封锁程度、丢包率、延迟），
时间段（高峰期），运营商QoS限速，你的本地物理宽带等等。
总结起来就是一句话：无法预测。
一般免费或付费shadowsocks站都会提供多个不同vps的节点供你选择切换。

5. 桌面右下角 任务栏 右键ss图标 选择 启用系统代理。
   系统代理模式 根据自己需要选择pac或全局代理 ，一般建议pac
6. 打开IE浏览器，访问https://www.youtube.com/

其他浏览器的shadowsocks代理设置参考上面的教程链接或下面的说明
网上找了几个客户端的使用教程 供参考
+ http://www.awolau.com/shadowsocks/shadowsocks-win7-xp.html
+ http://cnwall.tk/useage-muti-plat-shadowsocks/
+ https://cnlic.com/?paged=2

如果使用Shadowsocks，请清除或还原以前修改过的hosts文件，也请务必关闭其
他占用1080等端口的代理、翻墙软件

* 付费的shadowsocks节点
提供商鱼龙混杂，没个统一的流量和收费标准
确需购买，建议多比较几家的节点和流量
能提供试用当然最好，有月付，季付尽量不要选择年付。
现在基本所有的shadowsocks站都提供收费服务
以下链接是一部分提供收费服务的shadowsocks商家
非广告，非推广，来源网络，仅供参考

shadowsocks各种版本及教程:

+ www.wegotofqss.info
+ www.wegotofqss.info

+ https://www.fyzhuji.com/shadow.html
+ https://www.start-ss.biz/
+ https://www.deepss.org/index.php
+ http://my.ssjsq.net/
+ http://playss.co/
+ http://www.qiushiss.com/cart.php
+ https://www.bluecloud.pw/
+ http://www.hishadowsocks.com/
+ https://my.ssh91.net/
+ http://www.pgfastss.org/order.php
+ http://my.ssh91.net/cart.php
+ http://www.pgfastss.com/index.php
+ http://blog.onlybird.com/收费ssh代理
+ http://itti.xyz/
+ https://www.ezlink.hk/order
+ https://vnet.link/ 微林（中转）

*注意*：Shadowsocks.com不是shadowsocks官网，就是一个纯提供商业服务的网
站，所售服务和其他shadowsocks商业站一样。

公开的shadowsocks线路极易遭到恶意流量消耗和DDoS攻击或恶意破解ssh
现在明码公开的免费线路，网上论坛和v2ex 还有G+ twitter几乎已经没有了，
你可以试着自己搜一下 http://t.cn/RLTGXfn或http://t.cn/RLTGoxm

* 获取shadowsocks节点的几种方式
1. 抢码获取免费流量 免费或免费+收费的shadowsocks站，现在注册码都由站长
   或管理员严格控制发放了。肉少狼多，现在抢码有难度
2. 自己买vps搭建。 安全，流量独享。缺点;节点单一，速度如何没保证，靠人品值。
3. 买现成的ss服务商提供的服务

缺点：一般都有流量限制。
没有有效节点，想免费体验一把的只能自己想其他办法了。

+ http://www.hishadowsocks.com/ 4小时更新一次密码
+ http://www.ishadowsocks.com/ 6小时更新一次密码
+ http://www.surperoneblog.com/shadowsocks.php 6小时更新一次密码
+ http://sscat.cc/free/ 3小时更新一次密码
+ http://kf0.cc/ 4小时更新一次密码
+ https://www.ezlink.hk/free.php 密码每天0点更新
+ http://freehide.co.uk/free-shadowsocks/
+ https://namaho.com 半个月更换一次密码 不限速不限量不收费不负责
+ http://www.htovpn.net/?View=FreeSS 3小时更新一次密码 需要注册
+ http://sskuai.pw/
+ https://plus.google.com/communities/104092405342699579599 shadowsocks免费帐号
+ https://plus.google.com/communities/109962494203239446911
+ https://plus.google.com/+GhostAssassin/posts/NrDZWoXVjSD 免费shadowsocks大集合
+ http://www.fyhqy.com/356/
+ http://yyf.sg/code 免费shadowsocks邀请码集合站
+ QQ搜群 shadowsocks 有的shadowsocks qq群有免费ss线路或内部放邀请码
+ 以上链接或链接中的免费shadowsocks随时可能失效，这个就没啥好解释的了。
  有问题，自己随时google解决。

+ 1个shadowsocks讨论圈
  https://plus.google.com/s/shadowsocks

提醒一下
如非确实必要，尽量不要用shadowsocks全局
可以通过软件自带pac或浏览器安装代理管理扩展，实现智能分流
如何修改shadowsocks pac文件
http://www.awolau.com/shadowsocks/start-pac.html

实现科学上网时，启用系统代理后，Shadowsocks客户端会自动配置一个IE代理，使用本地127.0.0.1:1080，默认会选择PAC模式。关于PAC，大家可以参考维基百科。
选择PAC模式后，系统会根据PAC配置文件pac.txt(与Shadowsocks.exe同级目录)，
当你的浏览器访问这个配置文件里面配置的URL时，会使用代理，否则则不会使用代理。
这样既节省ss流量，也会提高国内网站的访问速度，这个很不错。
最后，如果大家发现有什么网站被Qiang了，可以在pac.txt这个文件里面添加这
个网站URL，即可通过ss的代理来访问了。同时，最好也定期从GFWList更新PAC。

* 如何制作便携版shadowsocks
下载2.5.6版（clowwindy）shadowsocks（只有高于这版的才支持制作便携版）
在 shadowsocks.exe 所在目录创建一个 shadowsocks_portable_mode.txt 文件
退出程序，重启程序
https://github.com/shadowsocks/shadowsocks-windows/releases

源码下架，可以自行寻找
注：SSR版貌似不支持此项功能

* shadowsocks俗称 纸飞机
ShadowSocks是Clowwindy开发的，一个轻量级的几乎跨平台的开源翻墙应用。
Shadowsocks 是一个安全的socks5代理，由于服务端与终端都简便易用，
目前配合VPS主机后十分稳定，已慢慢取代GAE等成为主流代理工具。

