public_html/Misc/Misc Notes/shadowsocks超详细科普教程.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>shadowsocks超详细科普教程</title>
<!-- 2016-04-28 Thu 00:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">shadowsocks超详细科普教程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Shadowsocks的小白使用教程</a></li>
<li><a href="#sec-2">付费的shadowsocks节点</a></li>
<li><a href="#sec-3">获取shadowsocks节点的几种方式</a></li>
<li><a href="#sec-4">如何制作便携版shadowsocks</a></li>
<li><a href="#sec-5">shadowsocks俗称 纸飞机</a></li>
<li><a href="#sec-6">Shadowsocks功能特性：</a>
<ul>
<li><a href="#sec-6-1">注意：</a></li>
<li><a href="#sec-6-2">安卓客户端-影梭的官网下载页面</a></li>
</ul>
</li>
<li><a href="#sec-7">shadowsockR</a></li>
<li><a href="#sec-8">路由器端shadowsocks教程</a></li>
<li><a href="#sec-9">iOS端 shadowsocks客户端教程</a></li>
<li><a href="#sec-10">shadowsocks客户端参数简单说明</a></li>
<li><a href="#sec-11">自己部署shadowsocks服务器端的教程</a>
<ul>
<li><a href="#sec-11-1">iOS端搭建anyconnect教程</a></li>
</ul>
</li>
<li><a href="#sec-12">关于VPS（虚拟专用服务器）的基础知识</a></li>
<li><a href="#sec-13">以后翻墙的方向，重点就是去中心化</a>
<ul>
<li><a href="#sec-13-1">fqrouter2作者:</a></li>
<li><a href="#sec-13-2">为何关闭fqrouter？</a></li>
<li><a href="#sec-13-3">shadowsocks 作者clowwindy:</a></li>
<li><a href="#sec-13-4">ShadowsocksBackup</a></li>
</ul>
</li>
<li><a href="#sec-14">Shadowsocks Windows 官方使用说明</a>
<ul>
<li><a href="#sec-14-1">功能</a></li>
<li><a href="#sec-14-2">下载</a></li>
<li><a href="#sec-14-3">PAC</a></li>
<li><a href="#sec-14-4">UDP</a></li>
<li><a href="#sec-14-5">多实例</a></li>
<li><a href="#sec-14-6">服务器配置</a></li>
<li><a href="#sec-14-7">绿色模式</a></li>
<li><a href="#sec-14-8">开发</a></li>
</ul>
</li>
<li><a href="#sec-15">附1 shadowsocks如何实现类VPN代理:</a></li>
<li><a href="#sec-16">附2 shadowsocks如何代理本地游戏客户端或其他软件客户端：</a></li>
<li><a href="#sec-17">附3 chrome浏览器SwitchyOmega扩展如何添加shadowsocks的代理设置:</a></li>
<li><a href="#sec-18">附4 全球付Globalcash虚拟信用卡和paypal申请教程：</a></li>
<li><a href="#sec-19">附5 什么是cn2?：</a></li>
</ul>
</div>
</div>
<p>
没有可用的shadowsocks节点线路，shadowsocks在你手里也是浮云这个作为重点先说一下
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Shadowsocks的小白使用教程</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://51.ruyo.net/p/412.html">http://51.ruyo.net/p/412.html</a>
</li>
<li><a href="http://t.cn/Ry42Kbx">http://t.cn/Ry42Kbx</a>
</li>
</ul>

<p>
chrome浏览器配合代理扩展的设置，下拉记事本滑块到底，看附3
首先明确一点，不管 Shadowsocks 有几种版本，都分为服务端和客户端，服务端是部署在服务器（VPS）上的，客户端是在你的电脑上使用的。简单说一下windows系统，你有shadowsocks节点的情况下，Shadowsocks客户端的设置代理使用教程一定要有有效SS节点才行 一定要有有效SS节点才行网或群共享下载Windows系统的Shadowsocks客户端软件为绿色免安装，下载 解压到任意目录，如：
D:/Program Files/shadowsocksshadowsocks的账号(本地客户端配置参数)一般包括这么几个部分
</p>

<p>
4-1 ：服务器 IP （一般为域名或数字ip）
</p>

<p>
4-2： Port ：服务器端口 （不同的账号的端口也都是不同的）
</p>

<p>
4-3 ：Password：你的密码
</p>

<p>
4-4 ：加密模式：鼠标点击下拉小三角选取
</p>

<p>
依次手动输入以下3项
shadowsocks 服务器域名或IP服务器端口密码并选择ss服务商提供的节点对应的加密方式点击“确定”右下角的 代理端口 指的是本地监听端口，一般保持默认1080就可以，不用你填。现在的ss站都提供二维码形式的ss节点配置参数文件对于二维码形式的ss节点配置文件，也可以用客户端自带的二维码扫描功能快速添加右键&gt;任务栏&gt;ss客户端图标&gt;服务器&gt;扫描屏幕二维码客户端支持添加多线路节点，方便你切换，选择相对你网络环境质量较好，速度快的节点。
shadowsocks节点速度快慢，影响shadowsocks节点速度的因素：你的机房（地理位置，影响节点路由），运营商（网络封锁程度、丢包率、延迟），时间段（高峰期），运营商QoS限速，你的本地物理宽带等等。总结起来就是一句话：无法预测。一般免费或付费shadowsocks站都会提供多个不同vps的节点供你选择切换。
</p>

<ol class="org-ol">
<li>桌面右下角 任务栏 右键ss图标 选择 启用系统代理。系统代理模式 根据自己需要选择pac或全局代理 ，一般建议pac
</li>
<li>打开IE浏览器，访问<a href="https://www.youtube.com/">https://www.youtube.com/</a>
</li>
</ol>

<p>
其他浏览器的shadowsocks代理设置参考上面的教程链接或下面的说明网上找了几个客户端的使用教程 供参考
</p>
<ul class="org-ul">
<li><a href="http://www.awolau.com/shadowsocks/shadowsocks-win7-xp.html">http://www.awolau.com/shadowsocks/shadowsocks-win7-xp.html</a>
</li>
<li><a href="http://cnwall.tk/useage-muti-plat-shadowsocks/">http://cnwall.tk/useage-muti-plat-shadowsocks/</a>
</li>
<li><a href="https://cnlic.com/?paged=2">https://cnlic.com/?paged=2</a>
</li>
</ul>

<p>
如果使用Shadowsocks，请清除或还原以前修改过的hosts文件，也请务必关闭其他占用1080等端口的代理、翻墙软件
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">付费的shadowsocks节点</h2>
<div class="outline-text-2" id="text-2">
<p>
提供商鱼龙混杂，没个统一的流量和收费标准确需购买，建议多比较几家的节点和流量能提供试用当然最好，有月付，季付尽量不要选择年付。现在基本所有的shadowsocks站都提供收费服务以下链接是一部分提供收费服务的shadowsocks商家非广告，非推广，来源网络，仅供参考
</p>

<p>
shadowsocks各种版本及教程:
</p>

<ul class="org-ul">
<li>www.wegotofqss.info
</li>
<li>www.wegotofqss.info
</li>

<li><a href="https://www.fyzhuji.com/shadow.html">https://www.fyzhuji.com/shadow.html</a>
</li>
<li><a href="https://www.start-ss.biz/">https://www.start-ss.biz/</a>
</li>
<li><a href="https://www.deepss.org/index.php">https://www.deepss.org/index.php</a>
</li>
<li><a href="http://my.ssjsq.net/">http://my.ssjsq.net/</a>
</li>
<li><a href="http://playss.co/">http://playss.co/</a>
</li>
<li><a href="http://www.qiushiss.com/cart.php">http://www.qiushiss.com/cart.php</a>
</li>
<li><a href="https://www.bluecloud.pw/">https://www.bluecloud.pw/</a>
</li>
<li><a href="http://www.hishadowsocks.com/">http://www.hishadowsocks.com/</a>
</li>
<li><a href="https://my.ssh91.net/">https://my.ssh91.net/</a>
</li>
<li><a href="http://www.pgfastss.org/order.php">http://www.pgfastss.org/order.php</a>
</li>
<li><a href="http://my.ssh91.net/cart.php">http://my.ssh91.net/cart.php</a>
</li>
<li><a href="http://www.pgfastss.com/index.php">http://www.pgfastss.com/index.php</a>
</li>
<li><a href="http://blog.onlybird.com/%E6%94%B6%E8%B4%B9ssh%E4%BB%A3%E7%90%86">http://blog.onlybird.com/%E6%94%B6%E8%B4%B9ssh%E4%BB%A3%E7%90%86</a>
</li>
<li><a href="http://itti.xyz/">http://itti.xyz/</a>
</li>
<li><a href="https://www.ezlink.hk/order">https://www.ezlink.hk/order</a>
</li>
<li><a href="https://vnet.link/">https://vnet.link/</a> 微林（中转）
</li>
</ul>

<p>
*注意*：Shadowsocks.com不是shadowsocks官网，就是一个纯提供商业服务的网站，所售服务和其他shadowsocks商业站一样。
</p>

<p>
公开的shadowsocks线路极易遭到恶意流量消耗和DDoS攻击或恶意破解ssh
现在明码公开的免费线路，网上论坛和v2ex 还有G+ twitter几乎已经没有了，你可以试着自己搜一下 <a href="http://t.cn/RLTGXfn%E6%88%96http://t.cn/RLTGoxm">http://t.cn/RLTGXfn%E6%88%96http://t.cn/RLTGoxm</a>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">获取shadowsocks节点的几种方式</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>抢码获取免费流量 免费或免费+收费的shadowsocks站，现在注册码都由站长或管理员严格控制发放了。肉少狼多，现在抢码有难度
</li>
<li>自己买vps搭建。 安全，流量独享。缺点;节点单一，速度如何没保证，靠人品值。
</li>
<li>买现成的ss服务商提供的服务
</li>
</ol>

<p>
缺点：一般都有流量限制。没有有效节点，想免费体验一把的只能自己想其他办法了。
</p>

<ul class="org-ul">
<li><a href="http://www.hishadowsocks.com/">http://www.hishadowsocks.com/</a> 4小时更新一次密码
</li>
<li><a href="http://www.ishadowsocks.com/">http://www.ishadowsocks.com/</a> 6小时更新一次密码
</li>
<li><a href="http://www.surperoneblog.com/shadowsocks.php">http://www.surperoneblog.com/shadowsocks.php</a> 6小时更新一次密码
</li>
<li><a href="http://sscat.cc/free/">http://sscat.cc/free/</a> 3小时更新一次密码
</li>
<li><a href="http://kf0.cc/">http://kf0.cc/</a> 4小时更新一次密码
</li>
<li><a href="https://www.ezlink.hk/free.php">https://www.ezlink.hk/free.php</a> 密码每天0点更新
</li>
<li><a href="http://freehide.co.uk/free-shadowsocks/">http://freehide.co.uk/free-shadowsocks/</a>
</li>
<li><a href="https://namaho.com">https://namaho.com</a> 半个月更换一次密码 不限速不限量不收费不负责
</li>
<li><a href="http://www.htovpn.net/?View=FreeSS">http://www.htovpn.net/?View=FreeSS</a> 3小时更新一次密码 需要注册
</li>
<li><a href="http://sskuai.pw/">http://sskuai.pw/</a>
</li>
<li><a href="https://plus.google.com/communities/104092405342699579599">https://plus.google.com/communities/104092405342699579599</a> shadowsocks免费帐号
</li>
<li><a href="https://plus.google.com/communities/109962494203239446911">https://plus.google.com/communities/109962494203239446911</a>
</li>
<li><a href="https://plus.google.com/+GhostAssassin/posts/NrDZWoXVjSD">https://plus.google.com/+GhostAssassin/posts/NrDZWoXVjSD</a> 免费shadowsocks大集合
</li>
<li><a href="http://www.fyhqy.com/356/">http://www.fyhqy.com/356/</a>
</li>
<li><a href="http://yyf.sg/code">http://yyf.sg/code</a> 免费shadowsocks邀请码集合站
</li>
<li>QQ搜群 shadowsocks 有的shadowsocks qq群有免费ss线路或内部放邀请码
</li>
<li>以上链接或链接中的免费shadowsocks随时可能失效，这个就没啥好解释的了。有问题，自己随时google解决。
</li>

<li>1个shadowsocks讨论圈
<a href="https://plus.google.com/s/shadowsocks">https://plus.google.com/s/shadowsocks</a>
</li>
</ul>

<p>
提醒一下如非确实必要，尽量不要用shadowsocks全局可以通过软件自带pac或浏览器安装代理管理扩展，实现智能分流如何修改shadowsocks pac文件
<a href="http://www.awolau.com/shadowsocks/start-pac.html">http://www.awolau.com/shadowsocks/start-pac.html</a>
</p>

<p>
实现科学上网时，启用系统代理后，Shadowsocks客户端会自动配置一个IE代理，使用本地127.0.0.1:1080，默认会选择PAC模式。关于PAC，大家可以参考维基百科。选择PAC模式后，系统会根据PAC配置文件pac.txt(与Shadowsocks.exe同级目录)，当你的浏览器访问这个配置文件里面配置的URL时，会使用代理，否则则不会使用代理。这样既节省ss流量，也会提高国内网站的访问速度，这个很不错。最后，如果大家发现有什么网站被Qiang了，可以在pac.txt这个文件里面添加这个网站URL，即可通过ss的代理来访问了。同时，最好也定期从GFWList更新PAC。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">如何制作便携版shadowsocks</h2>
<div class="outline-text-2" id="text-4">
<p>
下载2.5.6版（clowwindy）shadowsocks（只有高于这版的才支持制作便携版）在 shadowsocks.exe 所在目录创建一个 shadowsocks<sub>portable</sub><sub>mode</sub>.txt 文件退出程序，重启程序
<a href="https://github.com/shadowsocks/shadowsocks-windows/releases">https://github.com/shadowsocks/shadowsocks-windows/releases</a>
</p>

<p>
源码下架，可以自行寻找注：SSR版貌似不支持此项功能
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">shadowsocks俗称 纸飞机</h2>
<div class="outline-text-2" id="text-5">
<p>
ShadowSocks是Clowwindy开发的，一个轻量级的几乎跨平台的开源翻墙应用。
Shadowsocks 是一个安全的socks5代理，由于服务端与终端都简便易用，目前配合VPS主机后十分稳定，已慢慢取代GAE等成为主流代理工具。
</p>
</div>
</div>
