src/Misc/MiscNotes/shadowsocks超详细科普教程.org
* Shadowsocks功能特性：
1. 高性能：基于异步 I/O，事件驱动的程序实现；专为大并发、大流量的应用
   场景优化；无需保持连接状态，适用于移动设备及无线网络。

2. 低资源占用：完全以原生代码实现，后台服务内存占用不超过10MB。
3. 跨平台：可以在PC、MAC、智能手机（iPhone与Android）、甚至路由器（OpenWRT）中运行。
4. 安全：支持多种加密方案及多种加密强度，提供系统级别的网络数据加密。
5. 开源：由社区维护的开源项目，包括GPL及MIT两种协议的多种实现。

有必要先说明一下，用shadowsocks科学上网不是"免费"的。
shadowsocks软件是免费的,但必须要有架设好的服务器线路才能实现无障碍的“科学上网”。
架设shadowsocks需要自己购买vps，在服务器端搭建，或买别人搭建好出售流量的线路。
网上有免费分享的shadowsocks线路，这种是可以免费使用的。

shadowsocks官方信息
+ http://shadowsocks.org/en/download/clients.html
shadowsocks官网
+ http://shadowsocks.org/en/index.html
shadowsocks作者
+ https://www.v2ex.com/member/clowwindy
shadowsocks官方 pac
+ https://github.com/clowwindy/gfwlist2pac
shadowsocks官方的2种pac模式（无法更新了）
fast mode pac
+ https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy.pac
precise mode pac
+ https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy_abp.pac
  一个shadowsocks可用的可更新的pac
+ https://raw.githubusercontent.com/KyonLi/ss-pac/master/ss.pac

shadowsocks客户端官网下载页面
+ http://shadowsocks.org/en/download/clients.html
Windows系统shadowsocks旧版及MAC电脑客户端shadowsocks官方下载页面
+ http://sourceforge.net/projects/shadowsocksgui/files/dist/
github的下载链接(最新版)
+ https://github.com/shadowsocks/shadowsocks-windows/releases


低于2.5.2的旧版Shadowsocks-win-x.x.x.zip和Shadowsocks-win-dotnet4.0-x.x.x.zip的区别
For >= Windows 8 or with .Net 4.0, download Shadowsocks-win-dotnet4.0-x.x.x.zip.
For <= Windows 7 or with .Net 2.0, download Shadowsocks-win-x.x.x.zip.

** 注意：
NET 2.0不能在Windows10良好运行，
从2.5.2这个版本开始，我们不再支持.NET 2.0。最低要求 .Net 4.0
现在Shadowsocks-win-2.5.2.zip和Shadowsocks-win-dotnet4.0-2.5.2.zip是完全相同的文件。
如果您使用的是Windows XP或7，请安装.NET 4.0或更高版本。
负载均衡：就是多个连接分摊到各个服务器 随机选择服务器
高可用：按最低延迟+最稳定的标准（丢包率）自动选择一个服务器进行连接
累计丢包率：通过定时 ping 来测速和选择。如果要使用本功能，请打开菜单里
的统计可用性

+ shadowsocks作者关于windows2.0客户端功能性的说明
  http://www.chinagfw.org/2014/11/shadowsocks-for-windows-20.html
+ http://vc2tea.com/whats-shadowsocks/ 写给非专业人士看的 Shadowsocks 简介
+ https://blog.linuxeye.com/423.html Shadowsocks原理

** 安卓客户端-影梭的官网下载页面
+ https://play.google.com/store/apps/details?id=com.github.shadowsocks
+ https://github.com/shadowsocks/shadowsocks-android/releases

安卓未root，也可以使用shadowsocks

安卓版教程 http://51.ruyo.net/p/412.html
设置要点：路由-绕过局域网及中国大陆地址，全局代理-勾选“设置系统代理”。
设置完成后，点击右上角的开关，即可开启Shadowsocks代理
有特殊原因还在坚守fqrouter2的，可以添加自己的shadowsocks线路，添加后
fqrouter可满血复活

* shadowsockR
+ shadowsocks-rss版下载链接
+ shadowsockR就是第三方shadowsocks编译版（群共享的神奇海螺版shadowsocks-SSR）
+ shadowsockR官方链接：+ https://github.com/breakwa11/shadowsocks-rss
+ ShadowsocksR 服务端安装教程
+ https://github.com/breakwa11/shadowsocks-rss/wiki/Server-Setup
+ https://plus.google.com/u/0/+MikotoMisakamm
+ https://plus.google.com/u/0/118234153777431449917/posts
  使用第三方shadowsocks编译版前，请务必仔细阅读shadowsockR主页的参数解
  释和说明

* 路由器端shadowsocks教程
+ https://cokebar.info/
+ https://php-rmcr7.rhcloud.com/openwrt-fq/
+ http://hong.im/2014/03/16/configure-an-openwrt-based-router-to-use-shadowsocks-and-redirect-foreign-traffic/

具体哪些型号的路由器支持shadowsocks?
想自己动手的，淘宝搜 openWRT,QQ搜 群openWRT

* iOS端 shadowsocks客户端教程

iOS使用shadowsocks的前提条件是必须越狱！越狱！越狱！
+ http://www.pgssh.com/ios-shadowsocks.html
未越狱的话，ss客户端仅相当于一个内置浏览器，无法代理其他应用。
直接在appstore搜索 Shadowsocks，下载地址：
+ http://itunes.apple.com/us/app/shadowsocks/id665729974?ls=1&mt=8
iOS 越狱了的话，可以代理其他应用端。越狱的直接在 Cydia 里搜索 Shadowsocks ，然后安装。
+ http://jas0n.me/2014/11/12/up_14_11_12/
未越狱的iOS端建议使用anyconnectvpn或最近的神器Surge
+ http://www.cellsystech.com/docs/%E5%85%8D%E8%B4%B9%E6%9C%8D%E5%8A%A1%E5%99%A8%E4%BF%A1%E6%81%AF%E5%8F%8A%E5%8D%8F%E8%AE%AE/


关于Surge
已经提交apple,在AppStore上架
+ http://t.co/TF1WvOgq1c Surge AppStore 购买前说明。
购买直达链接： 
+ http://itunes.apple.com/cn/app/surge-web-developer-tool-proxy/id1040100637?ls=1&mt=8

Surge 新手使用指南
+ http://medium.com/@scomper/surge-%E9%85%8D%E7%BD%AE%E6%96%87%E4%BB%B6-a1533c10e80b
如何配置surge在ios中使用shadowsocks科学上网
+ http://ideafoc.us/2015/10/%E5%A6%82%E4%BD%95%E9%85%8D%E7%BD%AEsurge%E5%9C%A8ios%E4%B8%AD%E4%BD%BF%E7%94%A8shadowsocks%E7%A7%91%E5%AD%A6%E4%B8%8A%E7%BD%91/
+ http://surge.run/
+ http://gist.github.com/soffchen/05bc0f017a10486eb646
+ http://twitter.com/Blankwonder
+ http://plus.google.com/+LeoLiu/posts/GPvHQ7uj2iv
+ http://www.pgyer.com/b7c37752060a55ceeae89159d6cedd52
Surge可以去twitter上找作者要测试版
需要 OS X 10.10 / iOS 9.0 以上版本

* shadowsocks客户端参数简单说明
#+begin_src sh
"server"， 服务器名称 一般填写域名或ip
"server_port"， 服务端监听端口 填写ss提供者给你的服务器端口
"local_address"， 本地中转地址 通常为 127.0.0.1
"password"， 接入服务端密码
"method"， 加密方式 通常为 aes-256-cfb或rc4-md5
"local_port"， 本地监听端口， 默认为 1080 ，本地端口一般保持默认即可
"timeout"， 以秒为单位的连接超时时长
#+end_src


说明:ss://开头的地址是base64加密方式提供的shadowsocks线路，
解密方法：
复制ss:// 后面的字符串，解密后，就可以得到格式为method:password@IP:Port的服务器地址。
一个base64解密网站
http://tool.chinaz.com/Tools/Base64.aspx?jdfwkey=cvvmy


注意：

+ 切记遵守vps所在国法律，勿做违法或法律禁止事宜。
+ 千万不要挂shadowsocks使用p2p BT下载。
+ 因为美国的vps需要遵从美国的DMCA版权法律，如果该vps被用于bt下载，
+ 使用的vps的ip就会被记录下来。VPS商家就会封号，vps就会被停止服务。
+ 如果不想失去这个翻墙手段，最好不要翻墙的时候用p2p。

