public_html/Misc/Misc Notes/shadowsocks超详细科普教程.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Shadowsocks功能特性：</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>高性能：基于异步 I/O，事件驱动的程序实现；专为大并发、大流量的应用场景优化；无需保持连接状态，适用于移动设备及无线网络。
</li>

<li>低资源占用：完全以原生代码实现，后台服务内存占用不超过10MB。
</li>
<li>跨平台：可以在PC、MAC、智能手机（iPhone与Android）、甚至路由器（OpenWRT）中运行。
</li>
<li>安全：支持多种加密方案及多种加密强度，提供系统级别的网络数据加密。
</li>
<li>开源：由社区维护的开源项目，包括GPL及MIT两种协议的多种实现。
</li>
</ol>

<p>
有必要先说明一下，用shadowsocks科学上网不是"免费"的。
shadowsocks软件是免费的,但必须要有架设好的服务器线路才能实现无障碍的“科学上网”。架设shadowsocks需要自己购买vps，在服务器端搭建，或买别人搭建好出售流量的线路。网上有免费分享的shadowsocks线路，这种是可以免费使用的。
</p>

<p>
shadowsocks官方信息
</p>
<ul class="org-ul">
<li><a href="http://shadowsocks.org/en/download/clients.html">http://shadowsocks.org/en/download/clients.html</a>
</li>
</ul>
<p>
shadowsocks官网
</p>
<ul class="org-ul">
<li><a href="http://shadowsocks.org/en/index.html">http://shadowsocks.org/en/index.html</a>
</li>
</ul>
<p>
shadowsocks作者
</p>
<ul class="org-ul">
<li><a href="https://www.v2ex.com/member/clowwindy">https://www.v2ex.com/member/clowwindy</a>
</li>
</ul>
<p>
shadowsocks官方 pac
</p>
<ul class="org-ul">
<li><a href="https://github.com/clowwindy/gfwlist2pac">https://github.com/clowwindy/gfwlist2pac</a>
</li>
</ul>
<p>
shadowsocks官方的2种pac模式（无法更新了）
fast mode pac
</p>
<ul class="org-ul">
<li><a href="https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy.pac">https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy.pac</a>
</li>
</ul>
<p>
precise mode pac
</p>
<ul class="org-ul">
<li><a href="https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy_abp.pac">https://raw.githubusercontent.com/clowwindy/gfwlist2pac/master/test/proxy_abp.pac</a>
  一个shadowsocks可用的可更新的pac
</li>
<li><a href="https://raw.githubusercontent.com/KyonLi/ss-pac/master/ss.pac">https://raw.githubusercontent.com/KyonLi/ss-pac/master/ss.pac</a>
</li>
</ul>

<p>
shadowsocks客户端官网下载页面
</p>
<ul class="org-ul">
<li><a href="http://shadowsocks.org/en/download/clients.html">http://shadowsocks.org/en/download/clients.html</a>
</li>
</ul>
<p>
Windows系统shadowsocks旧版及MAC电脑客户端shadowsocks官方下载页面
</p>
<ul class="org-ul">
<li><a href="http://sourceforge.net/projects/shadowsocksgui/files/dist/">http://sourceforge.net/projects/shadowsocksgui/files/dist/</a>
</li>
</ul>
<p>
github的下载链接(最新版)
</p>
<ul class="org-ul">
<li><a href="https://github.com/shadowsocks/shadowsocks-windows/releases">https://github.com/shadowsocks/shadowsocks-windows/releases</a>
</li>
</ul>


<p>
低于2.5.2的旧版Shadowsocks-win-x.x.x.zip和Shadowsocks-win-dotnet4.0-x.x.x.zip的区别
For &gt;= Windows 8 or with .Net 4.0, download Shadowsocks-win-dotnet4.0-x.x.x.zip.
For &lt;= Windows 7 or with .Net 2.0, download Shadowsocks-win-x.x.x.zip.
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">注意：</h3>
<div class="outline-text-3" id="text-6-1">
<p>
NET 2.0不能在Windows10良好运行，从2.5.2这个版本开始，我们不再支持.NET 2.0。最低要求 .Net 4.0
现在Shadowsocks-win-2.5.2.zip和Shadowsocks-win-dotnet4.0-2.5.2.zip是完全相同的文件。如果您使用的是Windows XP或7，请安装.NET 4.0或更高版本。负载均衡：就是多个连接分摊到各个服务器 随机选择服务器高可用：按最低延迟+最稳定的标准（丢包率）自动选择一个服务器进行连接累计丢包率：通过定时 ping 来测速和选择。如果要使用本功能，请打开菜单里的统计可用性
</p>

<ul class="org-ul">
<li>shadowsocks作者关于windows2.0客户端功能性的说明
<a href="http://www.chinagfw.org/2014/11/shadowsocks-for-windows-20.html">http://www.chinagfw.org/2014/11/shadowsocks-for-windows-20.html</a>
</li>
<li><a href="http://vc2tea.com/whats-shadowsocks/">http://vc2tea.com/whats-shadowsocks/</a> 写给非专业人士看的 Shadowsocks 简介
</li>
<li><a href="https://blog.linuxeye.com/423.html">https://blog.linuxeye.com/423.html</a> Shadowsocks原理
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">安卓客户端-影梭的官网下载页面</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><a href="https://play.google.com/store/apps/details?id=com.github.shadowsocks">https://play.google.com/store/apps/details?id=com.github.shadowsocks</a>
</li>
<li><a href="https://github.com/shadowsocks/shadowsocks-android/releases">https://github.com/shadowsocks/shadowsocks-android/releases</a>
</li>
</ul>

<p>
安卓未root，也可以使用shadowsocks
</p>

<p>
安卓版教程 <a href="http://51.ruyo.net/p/412.html">http://51.ruyo.net/p/412.html</a>
设置要点：路由-绕过局域网及中国大陆地址，全局代理-勾选“设置系统代理”。设置完成后，点击右上角的开关，即可开启Shadowsocks代理有特殊原因还在坚守fqrouter2的，可以添加自己的shadowsocks线路，添加后
fqrouter可满血复活
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">shadowsockR</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>shadowsocks-rss版下载链接
</li>
<li>shadowsockR就是第三方shadowsocks编译版（群共享的神奇海螺版shadowsocks-SSR）
</li>
<li>shadowsockR官方链接：+ <a href="https://github.com/breakwa11/shadowsocks-rss">https://github.com/breakwa11/shadowsocks-rss</a>
</li>
<li>ShadowsocksR 服务端安装教程
</li>
<li><a href="https://github.com/breakwa11/shadowsocks-rss/wiki/Server-Setup">https://github.com/breakwa11/shadowsocks-rss/wiki/Server-Setup</a>
</li>
<li><a href="https://plus.google.com/u/0/+MikotoMisakamm">https://plus.google.com/u/0/+MikotoMisakamm</a>
</li>
<li><a href="https://plus.google.com/u/0/118234153777431449917/posts">https://plus.google.com/u/0/118234153777431449917/posts</a>
使用第三方shadowsocks编译版前，请务必仔细阅读shadowsockR主页的参数解释和说明
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">路由器端shadowsocks教程</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://cokebar.info/">https://cokebar.info/</a>
</li>
<li><a href="https://php-rmcr7.rhcloud.com/openwrt-fq/">https://php-rmcr7.rhcloud.com/openwrt-fq/</a>
</li>
<li><a href="http://hong.im/2014/03/16/configure-an-openwrt-based-router-to-use-shadowsocks-and-redirect-foreign-traffic/">http://hong.im/2014/03/16/configure-an-openwrt-based-router-to-use-shadowsocks-and-redirect-foreign-traffic/</a>
</li>
</ul>

<p>
具体哪些型号的路由器支持shadowsocks?
想自己动手的，淘宝搜 openWRT,QQ搜 群openWRT
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">iOS端 shadowsocks客户端教程</h2>
<div class="outline-text-2" id="text-9">
<p>
iOS使用shadowsocks的前提条件是必须越狱！越狱！越狱！
</p>
<ul class="org-ul">
<li><a href="http://www.pgssh.com/ios-shadowsocks.html">http://www.pgssh.com/ios-shadowsocks.html</a>
</li>
</ul>
<p>
未越狱的话，ss客户端仅相当于一个内置浏览器，无法代理其他应用。直接在appstore搜索 Shadowsocks，下载地址：
</p>
<ul class="org-ul">
<li><a href="http://itunes.apple.com/us/app/shadowsocks/id665729974?ls=1&mt=8">http://itunes.apple.com/us/app/shadowsocks/id665729974?ls=1&mt=8</a>
</li>
</ul>
<p>
iOS 越狱了的话，可以代理其他应用端。越狱的直接在 Cydia 里搜索 Shadowsocks ，然后安装。
</p>
<ul class="org-ul">
<li><a href="http://jas0n.me/2014/11/12/up_14_11_12/">http://jas0n.me/2014/11/12/up_14_11_12/</a>
</li>
</ul>
<p>
未越狱的iOS端建议使用anyconnectvpn或最近的神器Surge
</p>
<ul class="org-ul">
<li><a href="http://www.cellsystech.com/docs/%E5%85%8D%E8%B4%B9%E6%9C%8D%E5%8A%A1%E5%99%A8%E4%BF%A1%E6%81%AF%E5%8F%8A%E5%8D%8F%E8%AE%AE/">http://www.cellsystech.com/docs/%E5%85%8D%E8%B4%B9%E6%9C%8D%E5%8A%A1%E5%99%A8%E4%BF%A1%E6%81%AF%E5%8F%8A%E5%8D%8F%E8%AE%AE/</a>
</li>
</ul>


<p>
关于Surge
已经提交apple,在AppStore上架
</p>
<ul class="org-ul">
<li><a href="http://t.co/TF1WvOgq1c">http://t.co/TF1WvOgq1c</a> Surge AppStore 购买前说明。
</li>
</ul>
<p>
购买直达链接： 
</p>
<ul class="org-ul">
<li><a href="http://itunes.apple.com/cn/app/surge-web-developer-tool-proxy/id1040100637?ls=1&mt=8">http://itunes.apple.com/cn/app/surge-web-developer-tool-proxy/id1040100637?ls=1&mt=8</a>
</li>
</ul>

<p>
Surge 新手使用指南
</p>
<ul class="org-ul">
<li><a href="http://medium.com/@scomper/surge-%E9%85%8D%E7%BD%AE%E6%96%87%E4%BB%B6-a1533c10e80b">http://medium.com/@scomper/surge-%E9%85%8D%E7%BD%AE%E6%96%87%E4%BB%B6-a1533c10e80b</a>
</li>
</ul>
<p>
如何配置surge在ios中使用shadowsocks科学上网
</p>
<ul class="org-ul">
<li><a href="http://ideafoc.us/2015/10/%E5%A6%82%E4%BD%95%E9%85%8D%E7%BD%AEsurge%E5%9C%A8ios%E4%B8%AD%E4%BD%BF%E7%94%A8shadowsocks%E7%A7%91%E5%AD%A6%E4%B8%8A%E7%BD%91/">http://ideafoc.us/2015/10/%E5%A6%82%E4%BD%95%E9%85%8D%E7%BD%AEsurge%E5%9C%A8ios%E4%B8%AD%E4%BD%BF%E7%94%A8shadowsocks%E7%A7%91%E5%AD%A6%E4%B8%8A%E7%BD%91/</a>
</li>
<li><a href="http://surge.run/">http://surge.run/</a>
</li>
<li><a href="http://gist.github.com/soffchen/05bc0f017a10486eb646">http://gist.github.com/soffchen/05bc0f017a10486eb646</a>
</li>
<li><a href="http://twitter.com/Blankwonder">http://twitter.com/Blankwonder</a>
</li>
<li><a href="http://plus.google.com/+LeoLiu/posts/GPvHQ7uj2iv">http://plus.google.com/+LeoLiu/posts/GPvHQ7uj2iv</a>
</li>
<li><a href="http://www.pgyer.com/b7c37752060a55ceeae89159d6cedd52">http://www.pgyer.com/b7c37752060a55ceeae89159d6cedd52</a>
</li>
</ul>
<p>
Surge可以去twitter上找作者要测试版需要 OS X 10.10 / iOS 9.0 以上版本
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">shadowsocks客户端参数简单说明</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ffa07a;">"server"</span>&#65292; &#26381;&#21153;&#22120;&#21517;&#31216; &#19968;&#33324;&#22635;&#20889;&#22495;&#21517;&#25110;ip
<span style="color: #ffa07a;">"server_port"</span>&#65292; &#26381;&#21153;&#31471;&#30417;&#21548;&#31471;&#21475; &#22635;&#20889;ss&#25552;&#20379;&#32773;&#32473;&#20320;&#30340;&#26381;&#21153;&#22120;&#31471;&#21475;
<span style="color: #ffa07a;">"local_address"</span>&#65292; &#26412;&#22320;&#20013;&#36716;&#22320;&#22336; &#36890;&#24120;&#20026; 127.0.0.1
<span style="color: #ffa07a;">"password"</span>&#65292; &#25509;&#20837;&#26381;&#21153;&#31471;&#23494;&#30721;
<span style="color: #ffa07a;">"method"</span>&#65292; &#21152;&#23494;&#26041;&#24335; &#36890;&#24120;&#20026; aes-256-cfb&#25110;rc4-md5
<span style="color: #ffa07a;">"local_port"</span>&#65292; &#26412;&#22320;&#30417;&#21548;&#31471;&#21475;&#65292; &#40664;&#35748;&#20026; 1080 &#65292;&#26412;&#22320;&#31471;&#21475;&#19968;&#33324;&#20445;&#25345;&#40664;&#35748;&#21363;&#21487;
<span style="color: #ffa07a;">"timeout"</span>&#65292; &#20197;&#31186;&#20026;&#21333;&#20301;&#30340;&#36830;&#25509;&#36229;&#26102;&#26102;&#38271;
</pre>
</div>


<p>
说明:ss://开头的地址是base64加密方式提供的shadowsocks线路，解密方法：复制ss:// 后面的字符串，解密后，就可以得到格式为method:password@IP:Port的服务器地址。一个base64解密网站
<a href="http://tool.chinaz.com/Tools/Base64.aspx?jdfwkey=cvvmy">http://tool.chinaz.com/Tools/Base64.aspx?jdfwkey=cvvmy</a>
</p>


<p>
注意：
</p>

<ul class="org-ul">
<li>切记遵守vps所在国法律，勿做违法或法律禁止事宜。
</li>
<li>千万不要挂shadowsocks使用p2p BT下载。
</li>
<li>因为美国的vps需要遵从美国的DMCA版权法律，如果该vps被用于bt下载，
</li>
<li>使用的vps的ip就会被记录下来。VPS商家就会封号，vps就会被停止服务。
</li>
<li>如果不想失去这个翻墙手段，最好不要翻墙的时候用p2p。
</li>
</ul>
</div>
</div>
