src/Misc/MiscNotes/shadowsocks超详细科普教程.org
* 自己部署shadowsocks服务器端的教程
以下为vps端自己部署shadowsocks服务器端的教程，不是自己部署的就略过
大流量或重度用户建议自己搭建或购买适合自己流量,价位的shadowsocks服务
对个人隐私和安全性比较重视的，就自己部署shadowsocks服务器端吧
网上搭建和优化教程很多，自己动手搜一下。以下几个链接供参考
官网教程
+ https://github.com/shadowsocks/shadowsocks/wiki

网上搜集的一部分教程 打不开的链接挂代理访问
+ http://vbird.dic.ksu.edu.tw/
+ http://shadowsocks.blogspot.com/2015/01/shadowsocks.html
+ http://www.dothinking.cn/ruan-jian-jing-pin-wu/shadowsocks-vps.html
+ https://plus.google.com/103234343779069345365/posts/Xce4EJpLGhX
+ http://shadowsocks.blogspot.com/2015/01/shadowsocks.html
+ http://ju.outofmemory.cn/entry/114637
+ http://www.abclite.org/602
+ http://teddysun.com/399.html
+ https://php-rmcr7.rhcloud.com/shadowsocks-server/
+ http://www.fanyue.info/2015/02/shadowsocks.html 搬瓦工一键shadowsocks教程
+ http://jannerchang.tumblr.com/post/114392917710/4-23
+ http://www.cmsky.com/shadowsocks-manyuser-udp/ Shadowsocks-Manyuser开启UDP支持
+ http://www.cmsky.com/serverspeeder-install/ 安装锐速为网络加速
+ https://blog.linuxeye.com/423.html Shadowsocks一键安装脚本
+ https://blog.linuxeye.com/426.html ShadowSocks多用户管理系统搭建（moeSS+manyuser）
+ http://cnwall.tk/bandwagonhost-one-key-install-shadowsocks/
+ http://www.tennfy.com/3334.html
+ http://www.tennfy.com/2022.html
+ http://capbone.com/shadowsocks/
+ http://www.tennfy.com/2843.html
+ http://www.tennfy.com/2148.html
** iOS端搭建anyconnect教程
+ https://plus.google.com/+McGhostGao/posts/Z4gJrZsiRyp
+ http://lifehacker.io/post/108708838206/cisco-anyconnect-shadowsocks
+ http://ifreedomlife.com/2015/04/20/Setup-Cisco-AnyConnect-VPN-on-CentOS7/
+ http://jannerchang.tumblr.com/post/108814743720/centos7-strongswan-ios-vpn
+ http://goo.gl/WRW8ns
+ http://www.cmsky.com/anyconnect/

* 关于VPS（虚拟专用服务器）的基础知识
+ http://cnwall.tk/about-vps/
+ https://www.v2ex.com/go/vps
+ http://cnwall.tk/about-vps-ssh-client/
+ http://www.vpser.net/vps-howto
+ http://since1989.org/digitalocean/vps-vpn-shadowsocks.html
+ https://www.appfordev.com/68.html

几个vps测评网站（排名不分先后）：
1. LEB: http://lowendbox.com/
2. 老左博客： http://www.laozuo.org/vps
3. 主机测评： http://www.zhujiceping.com/
4. freehao123: http://www.freehao123.com/category/vps-zhuji/
5. 年付vps： http://www.yrvps.com/
6. 赵荣部落： http://www.zrblog.net/?
7. VPS推荐网 http://vpsadd.com/
8. 主机博士 http://www.drpsafe.com/
9. 小夜博客 http://www.vpsmm.com/
10. v2ex https://www.v2ex.com/go/vps

* 以后翻墙的方向，重点就是去中心化
** fqrouter2作者:
为何有fqrouter？
因为当年GFW还是一个入侵检测系统，不是一个防火墙。
这就意味着可以利用很多入侵检测系统的漏洞来做无代理的翻墙，这是很有意思
的事情。

** 为何关闭fqrouter？
因为今年GFW已经正式升级为一道防火墙了，google的成千上万个ip被封。
这种行为相当于把部分国际互联网进行了物理层面的拔网线。
今后的翻墙只有资源的比拼了，对于这种索然无味的事情我就不在这个上面浪费生命了。
那我怎么翻墙？（文字作者）
找渠道买shadowsocks帐号。这种零散的基于交易的行为是去中心化的，长期的，
有生命力的。


** shadowsocks 作者clowwindy:
从实际情况上来看，Shadowsocks 没有办法离开去中心化的服务器。要么自己花钱买 VPS，
要么用有人分享的账号，要么用有人提供的付费服务，他们各有所长，适合不同的人。

+ http://www.solidot.org/story?sid=45231

** ShadowsocksBackup
+ https://github.com/Long-live-shadowsocks
+ https://github.com/ShadowsocksBackup

* Shadowsocks Windows 官方使用说明
** 功能
+ 系统代理设置
+ PAC 模式和全局模式
+ GFWList 和用户规则
+ 支持 HTTP 代理
+ 支持多服务器切换
+ 支持 UDP 代理
** 下载
下载 最新版
https://github.com/shadowsocks/shadowsocks-windows/releases。

基本使用
在任务栏找到 Shadowsocks 图标
在 服务器 菜单添加多个服务器
选择 启用系统代理 来启用系统代理。请禁用浏览器里的代理插件，或把它们设置为使用系统代理。
除了设为系统代理，你也可以直接自己配置浏览器代理。在 SwitchyOmega 中把代理设置为 SOCKS5 或 HTTP 的 127.0.0.1:1080。这个 1080 端口可以在服务器设置中设置。
** PAC
可以编辑 PAC 文件来修改 PAC 设置。Shadowsocks 会监听文件变化，修改后会自动生效。
你也可以从 GFWList （由第三方维护）更新 PAC 文件。
你也可以使用在线 PAC URL
服务器自动切换
负载均衡：随机选择服务器
高可用：根据延迟和丢包率自动选择服务器
累计丢包率：通过定时 ping 来测速和选择。如果要使用本功能，请打开菜单里的统计可用性。
也可以实现 IStrategy 接口来自定义切换规则，然后给我们发一个 pull request。
** UDP
对于 UDP，请使用 SocksCap 或 ProxyCap 强制你想使用的程序走代理。
** 多实例
如果想使用其它工具如 SwitchyOmega 管理多个服务器，可以启动多个 Shadowsocks。 为了避免配置产生冲突，把 Shadowsocks 复制到一个新目录里，并给它设置一个新的本地端口。
另外在 SwitchyOmega 中需要使用 SOCKS5 代理，因为 HTTP 代理还是只会启动一个。

** 服务器配置
请访问 服务器
https://github.com/shadowsocks/shadowsocks/wiki/Ports-and-Clients#linux--server-side 获取更多信息。

** 绿色模式
如果你想把所有临时文件放在 shadowsocks/temp 目录而不是系统的 temp 目录， 可以在shadowsocks 所在目录创建一个 shadowsocks_portable_mode.txt 文件。
** 开发
Visual Studio 2015 is required.
授权
GPLv3

* 附1 shadowsocks如何实现类VPN代理:
+ Shadowsocks（Sock5代理）的PAC模式与全局模式与VPN的区别
  http://t.cn/Ry4wJ6x
+ 使用Proxifier把shadowsocks代理转为全局代理(类VPN)
  http://t.cn/Ry42ih9
+ Proxifier下载
  Proxifier 3.28 吕达嵘汉化注册版（安装即为注册版）
  http://www.hanzify.org/software/13717.html
+ Proxifier v3.28 破解版
  Initex.Software.Proxifier.v3.28.Standard.Edition.Incl.Keymaker-ZWT
  http://www89.zippyshare.com/v/5iEwpCKM/file.html
  Initex.Software.Proxifier.v3.28.Portable.Edition.Incl.Keymaker-ZWT
+ http://www12.zippyshare.com/v/BqNsbIiu/file.html
+ 本站系列教程： https://gochrome.info/tag/proxifier-series/

