public_html/Misc/Misc Notes/shadowsocks超详细科普教程.html

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">自己部署shadowsocks服务器端的教程</h2>
<div class="outline-text-2" id="text-11">
<p>
以下为vps端自己部署shadowsocks服务器端的教程，不是自己部署的就略过大流量或重度用户建议自己搭建或购买适合自己流量,价位的shadowsocks服务对个人隐私和安全性比较重视的，就自己部署shadowsocks服务器端吧网上搭建和优化教程很多，自己动手搜一下。以下几个链接供参考官网教程
</p>
<ul class="org-ul">
<li><a href="https://github.com/shadowsocks/shadowsocks/wiki">https://github.com/shadowsocks/shadowsocks/wiki</a>
</li>
</ul>

<p>
网上搜集的一部分教程 打不开的链接挂代理访问
</p>
<ul class="org-ul">
<li><a href="http://vbird.dic.ksu.edu.tw/">http://vbird.dic.ksu.edu.tw/</a>
</li>
<li><a href="http://shadowsocks.blogspot.com/2015/01/shadowsocks.html">http://shadowsocks.blogspot.com/2015/01/shadowsocks.html</a>
</li>
<li><a href="http://www.dothinking.cn/ruan-jian-jing-pin-wu/shadowsocks-vps.html">http://www.dothinking.cn/ruan-jian-jing-pin-wu/shadowsocks-vps.html</a>
</li>
<li><a href="https://plus.google.com/103234343779069345365/posts/Xce4EJpLGhX">https://plus.google.com/103234343779069345365/posts/Xce4EJpLGhX</a>
</li>
<li><a href="http://shadowsocks.blogspot.com/2015/01/shadowsocks.html">http://shadowsocks.blogspot.com/2015/01/shadowsocks.html</a>
</li>
<li><a href="http://ju.outofmemory.cn/entry/114637">http://ju.outofmemory.cn/entry/114637</a>
</li>
<li><a href="http://www.abclite.org/602">http://www.abclite.org/602</a>
</li>
<li><a href="http://teddysun.com/399.html">http://teddysun.com/399.html</a>
</li>
<li><a href="https://php-rmcr7.rhcloud.com/shadowsocks-server/">https://php-rmcr7.rhcloud.com/shadowsocks-server/</a>
</li>
<li><a href="http://www.fanyue.info/2015/02/shadowsocks.html">http://www.fanyue.info/2015/02/shadowsocks.html</a> 搬瓦工一键shadowsocks教程
</li>
<li><a href="http://jannerchang.tumblr.com/post/114392917710/4-23">http://jannerchang.tumblr.com/post/114392917710/4-23</a>
</li>
<li><a href="http://www.cmsky.com/shadowsocks-manyuser-udp/">http://www.cmsky.com/shadowsocks-manyuser-udp/</a> Shadowsocks-Manyuser开启UDP支持
</li>
<li><a href="http://www.cmsky.com/serverspeeder-install/">http://www.cmsky.com/serverspeeder-install/</a> 安装锐速为网络加速
</li>
<li><a href="https://blog.linuxeye.com/423.html">https://blog.linuxeye.com/423.html</a> Shadowsocks一键安装脚本
</li>
<li><a href="https://blog.linuxeye.com/426.html">https://blog.linuxeye.com/426.html</a> ShadowSocks多用户管理系统搭建（moeSS+manyuser）
</li>
<li><a href="http://cnwall.tk/bandwagonhost-one-key-install-shadowsocks/">http://cnwall.tk/bandwagonhost-one-key-install-shadowsocks/</a>
</li>
<li><a href="http://www.tennfy.com/3334.html">http://www.tennfy.com/3334.html</a>
</li>
<li><a href="http://www.tennfy.com/2022.html">http://www.tennfy.com/2022.html</a>
</li>
<li><a href="http://capbone.com/shadowsocks/">http://capbone.com/shadowsocks/</a>
</li>
<li><a href="http://www.tennfy.com/2843.html">http://www.tennfy.com/2843.html</a>
</li>
<li><a href="http://www.tennfy.com/2148.html">http://www.tennfy.com/2148.html</a>
</li>
</ul>
</div>
<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">iOS端搭建anyconnect教程</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li><a href="https://plus.google.com/+McGhostGao/posts/Z4gJrZsiRyp">https://plus.google.com/+McGhostGao/posts/Z4gJrZsiRyp</a>
</li>
<li><a href="http://lifehacker.io/post/108708838206/cisco-anyconnect-shadowsocks">http://lifehacker.io/post/108708838206/cisco-anyconnect-shadowsocks</a>
</li>
<li><a href="http://ifreedomlife.com/2015/04/20/Setup-Cisco-AnyConnect-VPN-on-CentOS7/">http://ifreedomlife.com/2015/04/20/Setup-Cisco-AnyConnect-VPN-on-CentOS7/</a>
</li>
<li><a href="http://jannerchang.tumblr.com/post/108814743720/centos7-strongswan-ios-vpn">http://jannerchang.tumblr.com/post/108814743720/centos7-strongswan-ios-vpn</a>
</li>
<li><a href="http://goo.gl/WRW8ns">http://goo.gl/WRW8ns</a>
</li>
<li><a href="http://www.cmsky.com/anyconnect/">http://www.cmsky.com/anyconnect/</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">关于VPS（虚拟专用服务器）的基础知识</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><a href="http://cnwall.tk/about-vps/">http://cnwall.tk/about-vps/</a>
</li>
<li><a href="https://www.v2ex.com/go/vps">https://www.v2ex.com/go/vps</a>
</li>
<li><a href="http://cnwall.tk/about-vps-ssh-client/">http://cnwall.tk/about-vps-ssh-client/</a>
</li>
<li><a href="http://www.vpser.net/vps-howto">http://www.vpser.net/vps-howto</a>
</li>
<li><a href="http://since1989.org/digitalocean/vps-vpn-shadowsocks.html">http://since1989.org/digitalocean/vps-vpn-shadowsocks.html</a>
</li>
<li><a href="https://www.appfordev.com/68.html">https://www.appfordev.com/68.html</a>
</li>
</ul>

<p>
几个vps测评网站（排名不分先后）：
</p>
<ol class="org-ol">
<li>LEB: <a href="http://lowendbox.com/">http://lowendbox.com/</a>
</li>
<li>老左博客： <a href="http://www.laozuo.org/vps">http://www.laozuo.org/vps</a>
</li>
<li>主机测评： <a href="http://www.zhujiceping.com/">http://www.zhujiceping.com/</a>
</li>
<li>freehao123: <a href="http://www.freehao123.com/category/vps-zhuji/">http://www.freehao123.com/category/vps-zhuji/</a>
</li>
<li>年付vps： <a href="http://www.yrvps.com/">http://www.yrvps.com/</a>
</li>
<li>赵荣部落： <a href="http://www.zrblog.net/">http://www.zrblog.net/</a>?
</li>
<li>VPS推荐网 <a href="http://vpsadd.com/">http://vpsadd.com/</a>
</li>
<li>主机博士 <a href="http://www.drpsafe.com/">http://www.drpsafe.com/</a>
</li>
<li>小夜博客 <a href="http://www.vpsmm.com/">http://www.vpsmm.com/</a>
</li>
<li>v2ex <a href="https://www.v2ex.com/go/vps">https://www.v2ex.com/go/vps</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">以后翻墙的方向，重点就是去中心化</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1">fqrouter2作者:</h3>
<div class="outline-text-3" id="text-13-1">
<p>
为何有fqrouter？因为当年GFW还是一个入侵检测系统，不是一个防火墙。这就意味着可以利用很多入侵检测系统的漏洞来做无代理的翻墙，这是很有意思的事情。
</p>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2">为何关闭fqrouter？</h3>
<div class="outline-text-3" id="text-13-2">
<p>
因为今年GFW已经正式升级为一道防火墙了，google的成千上万个ip被封。这种行为相当于把部分国际互联网进行了物理层面的拔网线。今后的翻墙只有资源的比拼了，对于这种索然无味的事情我就不在这个上面浪费生命了。那我怎么翻墙？（文字作者）找渠道买shadowsocks帐号。这种零散的基于交易的行为是去中心化的，长期的，有生命力的。
</p>
</div>
</div>


<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3">shadowsocks 作者clowwindy:</h3>
<div class="outline-text-3" id="text-13-3">
<p>
从实际情况上来看，Shadowsocks 没有办法离开去中心化的服务器。要么自己花钱买 VPS，要么用有人分享的账号，要么用有人提供的付费服务，他们各有所长，适合不同的人。
</p>

<ul class="org-ul">
<li><a href="http://www.solidot.org/story?sid=45231">http://www.solidot.org/story?sid=45231</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4">ShadowsocksBackup</h3>
<div class="outline-text-3" id="text-13-4">
<ul class="org-ul">
<li><a href="https://github.com/Long-live-shadowsocks">https://github.com/Long-live-shadowsocks</a>
</li>
<li><a href="https://github.com/ShadowsocksBackup">https://github.com/ShadowsocksBackup</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Shadowsocks Windows 官方使用说明</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1">功能</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li>系统代理设置
</li>
<li>PAC 模式和全局模式
</li>
<li>GFWList 和用户规则
</li>
<li>支持 HTTP 代理
</li>
<li>支持多服务器切换
</li>
<li>支持 UDP 代理
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2">下载</h3>
<div class="outline-text-3" id="text-14-2">
<p>
下载 最新版
<a href="https://github.com/shadowsocks/shadowsocks-windows/releases">https://github.com/shadowsocks/shadowsocks-windows/releases</a>。
</p>

<p>
基本使用在任务栏找到 Shadowsocks 图标在 服务器 菜单添加多个服务器选择 启用系统代理 来启用系统代理。请禁用浏览器里的代理插件，或把它们设置为使用系统代理。除了设为系统代理，你也可以直接自己配置浏览器代理。在 SwitchyOmega 中把代理设置为 SOCKS5 或 HTTP 的 127.0.0.1:1080。这个 1080 端口可以在服务器设置中设置。
</p>
</div>
</div>
<div id="outline-container-sec-14-3" class="outline-3">
<h3 id="sec-14-3">PAC</h3>
<div class="outline-text-3" id="text-14-3">
<p>
可以编辑 PAC 文件来修改 PAC 设置。Shadowsocks 会监听文件变化，修改后会自动生效。你也可以从 GFWList （由第三方维护）更新 PAC 文件。你也可以使用在线 PAC URL
服务器自动切换负载均衡：随机选择服务器高可用：根据延迟和丢包率自动选择服务器累计丢包率：通过定时 ping 来测速和选择。如果要使用本功能，请打开菜单里的统计可用性。也可以实现 IStrategy 接口来自定义切换规则，然后给我们发一个 pull request。
</p>
</div>
</div>
<div id="outline-container-sec-14-4" class="outline-3">
<h3 id="sec-14-4">UDP</h3>
<div class="outline-text-3" id="text-14-4">
<p>
对于 UDP，请使用 SocksCap 或 ProxyCap 强制你想使用的程序走代理。
</p>
</div>
</div>
<div id="outline-container-sec-14-5" class="outline-3">
<h3 id="sec-14-5">多实例</h3>
<div class="outline-text-3" id="text-14-5">
<p>
如果想使用其它工具如 SwitchyOmega 管理多个服务器，可以启动多个 Shadowsocks。 为了避免配置产生冲突，把 Shadowsocks 复制到一个新目录里，并给它设置一个新的本地端口。另外在 SwitchyOmega 中需要使用 SOCKS5 代理，因为 HTTP 代理还是只会启动一个。
</p>
</div>
</div>

<div id="outline-container-sec-14-6" class="outline-3">
<h3 id="sec-14-6">服务器配置</h3>
<div class="outline-text-3" id="text-14-6">
<p>
请访问 服务器
<a href="https://github.com/shadowsocks/shadowsocks/wiki/Ports-and-Clients#linux--server-side">https://github.com/shadowsocks/shadowsocks/wiki/Ports-and-Clients#linux--server-side</a> 获取更多信息。
</p>
</div>
</div>

<div id="outline-container-sec-14-7" class="outline-3">
<h3 id="sec-14-7">绿色模式</h3>
<div class="outline-text-3" id="text-14-7">
<p>
如果你想把所有临时文件放在 shadowsocks/temp 目录而不是系统的 temp 目录， 可以在shadowsocks 所在目录创建一个 shadowsocks<sub>portable</sub><sub>mode</sub>.txt 文件。
</p>
</div>
</div>
<div id="outline-container-sec-14-8" class="outline-3">
<h3 id="sec-14-8">开发</h3>
<div class="outline-text-3" id="text-14-8">
<p>
Visual Studio 2015 is required.
授权
GPLv3
</p>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">附1 shadowsocks如何实现类VPN代理:</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Shadowsocks（Sock5代理）的PAC模式与全局模式与VPN的区别
<a href="http://t.cn/Ry4wJ6x">http://t.cn/Ry4wJ6x</a>
</li>
<li>使用Proxifier把shadowsocks代理转为全局代理(类VPN)
<a href="http://t.cn/Ry42ih9">http://t.cn/Ry42ih9</a>
</li>
<li>Proxifier下载
Proxifier 3.28 吕达嵘汉化注册版（安装即为注册版）
<a href="http://www.hanzify.org/software/13717.html">http://www.hanzify.org/software/13717.html</a>
</li>
<li>Proxifier v3.28 破解版
Initex.Software.Proxifier.v3.28.Standard.Edition.Incl.Keymaker-ZWT
<a href="http://www89.zippyshare.com/v/5iEwpCKM/file.html">http://www89.zippyshare.com/v/5iEwpCKM/file.html</a>
Initex.Software.Proxifier.v3.28.Portable.Edition.Incl.Keymaker-ZWT
</li>
<li><a href="http://www12.zippyshare.com/v/BqNsbIiu/file.html">http://www12.zippyshare.com/v/BqNsbIiu/file.html</a>
</li>
<li>本站系列教程： <a href="https://gochrome.info/tag/proxifier-series/">https://gochrome.info/tag/proxifier-series/</a>
</li>
</ul>
</div>
</div>
