src/Misc/MiscNotes/shadowsocks超详细科普教程.org
* 附2 shadowsocks如何代理本地游戏客户端或其他软件客户端：

shadowsocks如何代理本地游戏客户端或其他软件客户端

关于代理UDP（以TCP转发或UDP转发均可）
官方shadowsocks和第三方客户端shadowsocksR最新版，都支持配合使用SocksCap64/SocksCap/ProxyCap等工具，把需要TCP和UDP代理的程序通过本版本程序转发。即不需要折腾OpenWrt或路由器即可在PC上获得UDP转发的能力，是游戏玩家的福音
如果你是个人用户，可自行更新服务端或向你的ss站长提议更新后端。
如果你是站长，可从https://github.com/breakwa11/shadowsocks/tree/manyuser
获取最新的多用户分支代码，与原版本兼容。

1. 需要第三方软件SocksCap64/SocksCap/ProxyCap
2. 需要有支持udp转发的shadowsocks节点

+ SocksCap64教程（SocksCap/ProxyCap使用方法大同小异）
  http://www.cmsky.com/sockscap64-shadowsocks/
+ SocksCap64免费
  http://www.sockscap64.com/
+ Sockscap 免费
  http://www.socksproxychecker.com/sockscap.html
+ Sockscap汉化版
  http://www.hanzify.org/software/8898.html
+ Proxycap
  http://www.proxycap.com/download.html

破解
+ x86 http://www43.zippyshare.com/v/39892822/file.html
+ x64 http://www74.zippyshare.com/v/12710611/file.html

注意：Proxifier 不支持处理 UDP 流量，Proxifier是靠实现类vpn方式实现第三方应用代理

* 附3 chrome浏览器SwitchyOmega扩展如何添加shadowsocks的代理设置:
chrome浏览器SwitchyOmega扩展如何添加shadowsocks的代理设置？
1. 添加shadowsocks的浏览器全局模式

#+begin_src html
右键SwitchyOmega扩展图标
选项>>
新建情景模式>>
名称：shadowsocks 全局(名称随便填)>>
类型：选择：代理服务器>>
点击：创建>>
代理协议：一定选择SOCKS5 ，代理服务器 填写127.0.0.1 ，代理端口填写
1080
#+end_src

2. 添加shadowsocks的浏览器pac模式

#+begin_src html
新建情景模式>>
名称：shadowsocks pac(名称随便填)>>
类型：选择：pac情景模式>>
点击：创建>>
pac网址>>复制下面这个链接到pac网址一栏
https://raw.githubusercontent.com/KyonLi/ss-pac/master/ss.pac
点击：立即更新情景模式
shadowsocks官方有2种pac模式，用哪个或都添加这个随你便
fast mode pac（快速）和precise mode pac（精确）
#+end_src

3.添加shadowsocks的"自动切换"代理模式，
+begin_src html
有个步骤用纯文字表诉的话，略微有点困难，这里掠过。
需要的自己导入OmegaOptions.bak
群共享和网盘的OmegaOptions.bak (文件大小243KB那个)
包括shadowsocks"自动切换" "shadowsockspac"和"shadowsocks全局" 3种情景模式，导入即可
#+end_src


+ SwitchyOmega 商店下载链接
  https://chrome.google.com/webstore/detail/proxy-switchyomega/padekgcemlokbadohgkifijomclgjgif
+ SwitchyOmega官方备用下载地址
  https://github.com/FelisCatus/SwitchyOmega/releases
+ 附：原gfwlist项目迁移到 https://github.com/gfwlist/gfwlist
  https://raw.githubusercontent.com/gfwlist/gfwlist/master/gfwlist.txt

本站原创switchyomega配置文件
+ switchyomega自动切换版：https://gochrome.info/switchyomega-config/
+ switchyomega虚拟情景版：https://gochrome.info/switchyomega-virtual/

站长推荐使用虚拟情景模式（共内置了8套模式）
+ 火狐浏览器添加规则和chrome大同小异
+ Google 即将关闭 Google Code，原gfwlist项目主页
+ https://code.google.com/p/autoproxy-gfwlist/

* 附4 全球付Globalcash虚拟信用卡和paypal申请教程：
全球付Globalcash虚拟信用卡和paypal注册申请教程
+ http://www.cmsky.com/globalcash/
+ http://jingyan.baidu.com/article/e73e26c0e3913b24adb6a7a4.html

* 附5 什么是cn2?：
+ 中国电信下一代承载网络（国际流量走的cn2线路）
  http://www.chinatelecom.com.cn/gjywpd/gj-qqwl/
  https://www.netroby.com/view.php?id=3459
  http://baike.baidu.com/subview/2193652/2193652.htm
  http://cablemap.info/ Greg's Cable Map
+ CN2网络延迟和丢包监控:
  http://183.91.49.53/public/sla/slaPerformanceNew.html

如果你连不上服务器，请首先检查SS客户端配置是否正确：
服务器域名或ip ，服务器端口 ，密码 ，加密方式，检查上面四项，确认没有填错。
如果均正常，依然连不上的话，请尝试Ping下 服务器域名或ip,看是否通；
如果不通，一般是你的线路问题（电信、联通、地域、时间等相关，有可能是暂时性问题）。
但注意在少数情况下，不管你是否能Ping通，都跟是否能连上ss服务器无关。
最后说下，一般都不会是服务器的问题，也就是说最大的可能性是：1.客户端参数配置，2.浏览器代理设置。

Shadowsocks 为什么出现 500 Internal Privoxy Error
可能原因：
1. 客户端的服务器信息错误
2. 服务端未正常启动或线路问题（被墙？）
3. 如果有使用端口转发，有可能是转发线路问题

通俗点说
1. 客户端配置参数填错，或参数有变化,自己更新不及时
2. 服务器端挂了，或线路被墙 （可能性很小）
3. 使用端口转发的，联系你的服务商

可能有人会有觉得100多人同时在用一个服务器会非常慢，
但实际上这点用户数对服务器造成的压力并没你想像中的大。
根据过去的服务器监控数据来看，平时的带宽使用平均在12Mbps左右，
间中会有去到20Mbps的突发流量，可以说完全没有压力。
CPU使用率长期在10%以下。内存方面没做太多优化，保持在60%左右。
或者100人同时在看视频的话，带宽可能就真的有压力，但这种概率几乎不存在，
而且就算你家有100Mbps的宽带，服务器也有100Mbps的带宽，你也会受中间线路最小带宽路段的限制，想像下木桶短板原理，而且“网络”中还有很多你意想不到的情况和条件存在，所以用（总带宽/使用人数来）算每人得到的带宽这种方法实在不合理。


