public_html/Misc/Misc Notes/shadowsocks超详细科普教程.html

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">附2 shadowsocks如何代理本地游戏客户端或其他软件客户端：</h2>
<div class="outline-text-2" id="text-16">
<p>
shadowsocks如何代理本地游戏客户端或其他软件客户端
</p>

<p>
关于代理UDP（以TCP转发或UDP转发均可）官方shadowsocks和第三方客户端shadowsocksR最新版，都支持配合使用SocksCap64/SocksCap/ProxyCap等工具，把需要TCP和UDP代理的程序通过本版本程序转发。即不需要折腾OpenWrt或路由器即可在PC上获得UDP转发的能力，是游戏玩家的福音如果你是个人用户，可自行更新服务端或向你的ss站长提议更新后端。如果你是站长，可从<a href="https://github.com/breakwa11/shadowsocks/tree/manyuser">https://github.com/breakwa11/shadowsocks/tree/manyuser</a>
获取最新的多用户分支代码，与原版本兼容。
</p>

<ol class="org-ol">
<li>需要第三方软件SocksCap64/SocksCap/ProxyCap
</li>
<li>需要有支持udp转发的shadowsocks节点
</li>

<li>SocksCap64教程（SocksCap/ProxyCap使用方法大同小异）
<a href="http://www.cmsky.com/sockscap64-shadowsocks/">http://www.cmsky.com/sockscap64-shadowsocks/</a>
</li>
<li>SocksCap64免费
<a href="http://www.sockscap64.com/">http://www.sockscap64.com/</a>
</li>
<li>Sockscap 免费
<a href="http://www.socksproxychecker.com/sockscap.html">http://www.socksproxychecker.com/sockscap.html</a>
</li>
<li>Sockscap汉化版
<a href="http://www.hanzify.org/software/8898.html">http://www.hanzify.org/software/8898.html</a>
</li>
<li>Proxycap
<a href="http://www.proxycap.com/download.html">http://www.proxycap.com/download.html</a>
</li>
</ol>

<p>
破解
</p>
<ul class="org-ul">
<li>x86 <a href="http://www43.zippyshare.com/v/39892822/file.html">http://www43.zippyshare.com/v/39892822/file.html</a>
</li>
<li>x64 <a href="http://www74.zippyshare.com/v/12710611/file.html">http://www74.zippyshare.com/v/12710611/file.html</a>
</li>
</ul>

<p>
注意：Proxifier 不支持处理 UDP 流量，Proxifier是靠实现类vpn方式实现第三方应用代理
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">附3 chrome浏览器SwitchyOmega扩展如何添加shadowsocks的代理设置:</h2>
<div class="outline-text-2" id="text-17">
<p>
chrome浏览器SwitchyOmega扩展如何添加shadowsocks的代理设置？
</p>
<ol class="org-ol">
<li>添加shadowsocks的浏览器全局模式
</li>
</ol>

<div class="org-src-container">

<pre class="src src-html">&#21491;&#38190;SwitchyOmega&#25193;&#23637;&#22270;&#26631;
&#36873;&#39033;&gt;&gt;
&#26032;&#24314;&#24773;&#26223;&#27169;&#24335;&gt;&gt;
&#21517;&#31216;&#65306;shadowsocks &#20840;&#23616;(&#21517;&#31216;&#38543;&#20415;&#22635;)&gt;&gt;
&#31867;&#22411;&#65306;&#36873;&#25321;&#65306;&#20195;&#29702;&#26381;&#21153;&#22120;&gt;&gt;
&#28857;&#20987;&#65306;&#21019;&#24314;&gt;&gt;
&#20195;&#29702;&#21327;&#35758;&#65306;&#19968;&#23450;&#36873;&#25321;SOCKS5 &#65292;&#20195;&#29702;&#26381;&#21153;&#22120; &#22635;&#20889;127.0.0.1 &#65292;&#20195;&#29702;&#31471;&#21475;&#22635;&#20889;
1080
</pre>
</div>

<ol class="org-ol">
<li>添加shadowsocks的浏览器pac模式
</li>
</ol>

<div class="org-src-container">

<pre class="src src-html">&#26032;&#24314;&#24773;&#26223;&#27169;&#24335;&gt;&gt;
&#21517;&#31216;&#65306;shadowsocks pac(&#21517;&#31216;&#38543;&#20415;&#22635;)&gt;&gt;
&#31867;&#22411;&#65306;&#36873;&#25321;&#65306;pac&#24773;&#26223;&#27169;&#24335;&gt;&gt;
&#28857;&#20987;&#65306;&#21019;&#24314;&gt;&gt;
pac&#32593;&#22336;&gt;&gt;&#22797;&#21046;&#19979;&#38754;&#36825;&#20010;&#38142;&#25509;&#21040;pac&#32593;&#22336;&#19968;&#26639;
https://raw.githubusercontent.com/KyonLi/ss-pac/master/ss.pac
&#28857;&#20987;&#65306;&#31435;&#21363;&#26356;&#26032;&#24773;&#26223;&#27169;&#24335;
shadowsocks&#23448;&#26041;&#26377;2&#31181;pac&#27169;&#24335;&#65292;&#29992;&#21738;&#20010;&#25110;&#37117;&#28155;&#21152;&#36825;&#20010;&#38543;&#20320;&#20415;
fast mode pac&#65288;&#24555;&#36895;&#65289;&#21644;precise mode pac&#65288;&#31934;&#30830;&#65289;
</pre>
</div>

<p>
3.添加shadowsocks的"自动切换"代理模式，
+begin<sub>src</sub> html
有个步骤用纯文字表诉的话，略微有点困难，这里掠过。需要的自己导入OmegaOptions.bak
群共享和网盘的OmegaOptions.bak (文件大小243KB那个)
包括shadowsocks"自动切换" "shadowsockspac"和"shadowsocks全局" 3种情景模式，导入即可
#+end<sub>src</sub>
</p>


<ul class="org-ul">
<li>SwitchyOmega 商店下载链接
<a href="https://chrome.google.com/webstore/detail/proxy-switchyomega/padekgcemlokbadohgkifijomclgjgif">https://chrome.google.com/webstore/detail/proxy-switchyomega/padekgcemlokbadohgkifijomclgjgif</a>
</li>
<li>SwitchyOmega官方备用下载地址
<a href="https://github.com/FelisCatus/SwitchyOmega/releases">https://github.com/FelisCatus/SwitchyOmega/releases</a>
</li>
<li>附：原gfwlist项目迁移到 <a href="https://github.com/gfwlist/gfwlist">https://github.com/gfwlist/gfwlist</a>
  <a href="https://raw.githubusercontent.com/gfwlist/gfwlist/master/gfwlist.txt">https://raw.githubusercontent.com/gfwlist/gfwlist/master/gfwlist.txt</a>
</li>
</ul>

<p>
本站原创switchyomega配置文件
</p>
<ul class="org-ul">
<li>switchyomega自动切换版：<a href="https://gochrome.info/switchyomega-config/">https://gochrome.info/switchyomega-config/</a>
</li>
<li>switchyomega虚拟情景版：<a href="https://gochrome.info/switchyomega-virtual/">https://gochrome.info/switchyomega-virtual/</a>
</li>
</ul>

<p>
站长推荐使用虚拟情景模式（共内置了8套模式）
</p>
<ul class="org-ul">
<li>火狐浏览器添加规则和chrome大同小异
</li>
<li>Google 即将关闭 Google Code，原gfwlist项目主页
</li>
<li><a href="https://code.google.com/p/autoproxy-gfwlist/">https://code.google.com/p/autoproxy-gfwlist/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">附4 全球付Globalcash虚拟信用卡和paypal申请教程：</h2>
<div class="outline-text-2" id="text-18">
<p>
全球付Globalcash虚拟信用卡和paypal注册申请教程
</p>
<ul class="org-ul">
<li><a href="http://www.cmsky.com/globalcash/">http://www.cmsky.com/globalcash/</a>
</li>
<li><a href="http://jingyan.baidu.com/article/e73e26c0e3913b24adb6a7a4.html">http://jingyan.baidu.com/article/e73e26c0e3913b24adb6a7a4.html</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">附5 什么是cn2?：</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>中国电信下一代承载网络（国际流量走的cn2线路）
<a href="http://www.chinatelecom.com.cn/gjywpd/gj-qqwl/">http://www.chinatelecom.com.cn/gjywpd/gj-qqwl/</a>
<a href="https://www.netroby.com/view.php?id=3459">https://www.netroby.com/view.php?id=3459</a>
<a href="http://baike.baidu.com/subview/2193652/2193652.htm">http://baike.baidu.com/subview/2193652/2193652.htm</a>
<a href="http://cablemap.info/">http://cablemap.info/</a> Greg's Cable Map
</li>
<li>CN2网络延迟和丢包监控:
<a href="http://183.91.49.53/public/sla/slaPerformanceNew.html">http://183.91.49.53/public/sla/slaPerformanceNew.html</a>
</li>
</ul>

<p>
如果你连不上服务器，请首先检查SS客户端配置是否正确：服务器域名或ip ，服务器端口 ，密码 ，加密方式，检查上面四项，确认没有填错。如果均正常，依然连不上的话，请尝试Ping下 服务器域名或ip,看是否通；如果不通，一般是你的线路问题（电信、联通、地域、时间等相关，有可能是暂时性问题）。但注意在少数情况下，不管你是否能Ping通，都跟是否能连上ss服务器无关。最后说下，一般都不会是服务器的问题，也就是说最大的可能性是：1.客户端参数配置，2.浏览器代理设置。
</p>

<p>
Shadowsocks 为什么出现 500 Internal Privoxy Error
可能原因：
</p>
<ol class="org-ol">
<li>客户端的服务器信息错误
</li>
<li>服务端未正常启动或线路问题（被墙？）
</li>
<li>如果有使用端口转发，有可能是转发线路问题
</li>
</ol>

<p>
通俗点说
</p>
<ol class="org-ol">
<li>客户端配置参数填错，或参数有变化,自己更新不及时
</li>
<li>服务器端挂了，或线路被墙 （可能性很小）
</li>
<li>使用端口转发的，联系你的服务商
</li>
</ol>

<p>
可能有人会有觉得100多人同时在用一个服务器会非常慢，但实际上这点用户数对服务器造成的压力并没你想像中的大。根据过去的服务器监控数据来看，平时的带宽使用平均在12Mbps左右，间中会有去到20Mbps的突发流量，可以说完全没有压力。
CPU使用率长期在10%以下。内存方面没做太多优化，保持在60%左右。或者100人同时在看视频的话，带宽可能就真的有压力，但这种概率几乎不存在，而且就算你家有100Mbps的宽带，服务器也有100Mbps的带宽，你也会受中间线路最小带宽路段的限制，想像下木桶短板原理，而且“网络”中还有很多你意想不到的情况和条件存在，所以用（总带宽/使用人数来）算每人得到的带宽这种方法实在不合理。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-04-28 Thu 00:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
